app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "jjjjjjjjjjjj"], ["category", "jjjjjjjjjjjj"], ["body", "jjjjjjjjjjjj"], ["created_at", "2020-03-30 08:05:41.635809"], ["updated_at", "2020-03-30 08:05:41.635809"]]
---
  def create
  	blog = Blog.new(blog_params)
    blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "kkkkkkkl"], ["updated_at", "2020-03-30 08:40:52.786901"], ["id", 5]]
---
  def update
  	blog = Blog.find(params[:id])
  	blog.update(blog_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 4]]
---
  def destroy
  	blog = Blog.find(params[:id])
  	blog.destroy